Revit 2024 API
ParameterTypeId.RoomPowerLoadUnitsParam Property
 "Power Load Units"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RoomPowerLoadUnitsParam { get; }
Visual Basic
Public Shared ReadOnly Property RoomPowerLoadUnitsParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RoomPowerLoadUnitsParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace